tap "hashicorp/tap"
tap "libsql/sqld"
tap "plentico/plenti"
tap "supabase/tap"
tap "tursodatabase/tap"
# Run your GitHub Actions locally
brew "act"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# OpenType text shaping engine
brew "harfbuzz"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy", restart_service: :changed
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Command-line tool for DigitalOcean
brew "doctl"
# Fast and simple Node.js version manager
brew "fnm"
# GitHub command-line tool
brew "gh"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Distributed revision control system
brew "git"
# Highly customizable changelog generator
brew "git-cliff"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# X.509 and CMS library
brew "libksba"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Tool for glamorous shell scripts
brew "gum"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# General purpose TCP-IP emulator
brew "libslirp"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Access X11 clipboards from the command-line
brew "xclip"
# Supabase CLI
brew "supabase/tap/supabase"
brew "tursodatabase/tap/turso"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Menu bar manager
cask "jordanbaird-ice"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Cloud gaming platform
cask "nvidia-geforce-now"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
vscode "alimozdemir.vscode-nuxt-dx-tools"
vscode "antfu.browse-lite"
vscode "antfu.goto-alias"
vscode "antfu.vite"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cpylua.language-postcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "dzannotti.vscode-babel-coloring"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "jock.svg"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "mubaidr.vuejs-extension-pack"
vscode "neilding.language-liquid"
vscode "nuxt.mdc"
vscode "nuxtr.nuxtr-vscode"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "sdras.vue-vscode-snippets"
vscode "svelte.svelte-vscode"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vue.volar"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "znck.grammarly"
